# AllowAutoEmbed Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..AllowAutoEmbed Property
ParameterTypeId Class See Also
---
"Automatically Embed"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId AllowAutoEmbed { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property AllowAutoEmbed As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ AllowAutoEmbed {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace